In [5]:
import pandas as pd

In [6]:
df1 = pd.DataFrame({'calisanlar' : ['Ali','Veli','Ayse','Fatma'],
                   'grup':['Muhasebe','Muhendislik','Muhendislik','İnsan Kaynakları']})

In [8]:
df1

  calisanlar              grup
0        Ali          Muhasebe
1       Veli       Muhendislik
2       Ayse       Muhendislik
3      Fatma  İnsan Kaynakları

In [9]:
df2 = pd.DataFrame({'calisanlar' : ['Ali','Veli','Ayse','Fatma'],
                   'ilk_giris':[2010,2006,2018,2021]})

In [10]:
df2

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2006
2       Ayse       2018
3      Fatma       2021

In [11]:
pd.merge(df1,df2)

  calisanlar              grup  ilk_giris
0        Ali          Muhasebe       2010
1       Veli       Muhendislik       2006
2       Ayse       Muhendislik       2018
3      Fatma  İnsan Kaynakları       2021

merge fonksiyonu birleşmenin hangi bileşene göre yapılcağını anlıyor.

In [12]:
pd.merge(df1,df2 , on='calisanlar')

  calisanlar              grup  ilk_giris
0        Ali          Muhasebe       2010
1       Veli       Muhendislik       2006
2       Ayse       Muhendislik       2018
3      Fatma  İnsan Kaynakları       2021

Belirtmek istersek ise on='gireceğiniz özellik' olarak girerseniz uygulamış olursunuz.

# Çoktan Teke Birleştirme #

In [13]:
df3= pd.merge(df1,df2)
df3

  calisanlar              grup  ilk_giris
0        Ali          Muhasebe       2010
1       Veli       Muhendislik       2006
2       Ayse       Muhendislik       2018
3      Fatma  İnsan Kaynakları       2021

In [14]:
df4=pd.DataFrame({"grup":["Muhasebe","Muhendislik","İnsan Kaynakları"],
                 "müdürad":["can","berke","sudenaz"]})
df4

               grup  müdürad
0          Muhasebe      can
1       Muhendislik    berke
2  İnsan Kaynakları  sudenaz

In [15]:
pd.merge(df3,df4)

  calisanlar              grup  ilk_giris  müdürad
0        Ali          Muhasebe       2010      can
1       Veli       Muhendislik       2006    berke
2       Ayse       Muhendislik       2018    berke
3      Fatma  İnsan Kaynakları       2021  sudenaz

# Çoktan çoka birleştirme İşlemleri #

In [16]:
df5=pd.DataFrame({"grup":["Muhasebe","Muhasebe","Muhendislik","Muhendislik","İnsan Kaynakları","İnsan Kaynakları"],
                 "yetenekler":["matematik","excel","kodlama","linux","excel","yonetim"]})
df5

               grup yetenekler
0          Muhasebe  matematik
1          Muhasebe      excel
2       Muhendislik    kodlama
3       Muhendislik      linux
4  İnsan Kaynakları      excel
5  İnsan Kaynakları    yonetim

In [17]:
df1

  calisanlar              grup
0        Ali          Muhasebe
1       Veli       Muhendislik
2       Ayse       Muhendislik
3      Fatma  İnsan Kaynakları

In [18]:
pd.merge(df1,df5)

  calisanlar              grup yetenekler
0        Ali          Muhasebe  matematik
1        Ali          Muhasebe      excel
2       Veli       Muhendislik    kodlama
3       Veli       Muhendislik      linux
4       Ayse       Muhendislik    kodlama
5       Ayse       Muhendislik      linux
6      Fatma  İnsan Kaynakları      excel
7      Fatma  İnsan Kaynakları    yonetim